---
title: FamilyParameterSet
classe: Autodesk.Revit.DB.FamilyParameterSet
namespace: Autodesk.Revit.DB
eredita: Autodesk.Revit.DB.APIObject
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 9
---

# FamilyParameterSet

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean IsEmpty { get; }` | `familyParameterSet.IsEmpty` | Boolean |
| `Int32 Size { get; }` | `familyParameterSet.Size` | Int32 |
| `Void Clear()` | `familyParameterSet.Clear()` | Void |
| `Boolean Contains(FamilyParameter)` | `familyParameterSet.Contains(item)` | Boolean |
| `Int32 Erase(FamilyParameter)` | `familyParameterSet.Erase(item)` | Int32 |
| `FamilyParameterSetIterator ForwardIterator()` | `familyParameterSet.ForwardIterator()` | FamilyParameterSetIterator |
| `IEnumerator GetEnumerator()` | `familyParameterSet.GetEnumerator()` | IEnumerator |
| `Boolean Insert(FamilyParameter)` | `familyParameterSet.Insert(item)` | Boolean |
| `FamilyParameterSetIterator ReverseIterator()` | `familyParameterSet.ReverseIterator()` | FamilyParameterSetIterator |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```